<ol>
    <li>Подключаемые ресурсы на страницу - в случае части другой CMS</li>
    <li>Ограничение кол-ва логов</li>
    <li>Ротация логов/эксепшенов</li>
    <li>Test manager</li>
    <li>Отсортировать и почистить Defines</li>
    <li>DirManager почистить</li>
    <li>Handlers выкинуть</li>
    <li>Img mosaic</li>
    <li>Smarty шаблоны подключать по пути</li>
    <li>Подключение ресурсов на страницу в WP</li>
    <li>Переписать работу с плагинами</li>
    <li>File Uploads, возвращаемые параметры, path</li>
    <li>Возможность перестроения базы без перестроения SDK</li>
    <li>Проектный TODO</li>
    <li>
        <h5>
            Плагины
        </h5>
        <ol>
            <li>
                Плагины, требующие авторизации
            </li>
            <li>
                Разработать плагин - изучение тригонометрических функций
            </li>
		    <li>В матрицах - скрывать результат умножения для самопроверки</li>
        </ol>
    </li>
    <li>
        <h5>
            Акции
        </h5>
        <ol>
            <li>
                Додумать работу с акциями, выкинуть лишние классы, ответы
            </li>
            <li>
                Перенести все ресурсы для акций, разбросанные по проекту, в IP_Stock
            </li>
            <li>
                ImgSnapshot - попробовать использовать cache
            </li>
            <li>
                Отличать по данным
            </li>
        </ol>
    </li>
    <li>
        <h5>Картинки</h5>
        <ol>
            <li>
                Разобраться с {imgp dir='4use' name='icon_paintbrush128.png'}преобразованием картинок{/imgp}.
            </li>
        </ol>
    </li>
    <li>
        <h5>Базовая накачка</h5>
        <ol>
    		<li>Проверить текст базовых шаблонных сообщений</li>
    		<li>Базовая накачка, данные администратора - аватар и т.д.</li>
        </ol>
    </li>
    <li>
        <h5>Рефакторинг</h5>
        <ol>
            <li>IdHelper - выкинуть</li>
            <li>Defines refactoring</li>
    		<li>Переписать PP_print.php</li>
            <li>Предварительный просмотр для печати, убрать кнопки управления дискуссией</li>
            <li><b>TODO</b>`s</li>
        </ol>
    </li>
    <li>
        <h5>{red}Баги{/red}</h5>
        <ol>
            <li>В эксплорере при наведении на картинки-ссылки, они сдвигаются вниз</li>
    		<li>Избавиться от isVisible, проблема с AdvGraph</li>
            <li>Разобраться с пропаданием табов</li>
            <li>В хроме не показывается карточка клиента при наведении на открытую ячейку в мозайке</li>    
			<li>Избавиться от cssDimension('heigth')</li>
    		<li>Не удалось получить свойство "SetReturnValue" ссылки, значение которой не определено или является NULL - проблема в InternetExplorer с Flash</li>
            <li>Нужен двойной клик при сабмите формы из-за валидации</li>
            <li>Пишется двойной лог при обращении на сервер</li>
        </ol>
    </li>
    <li>&lt;selects&gt; - paddings and groups</li>    
    <li>Работа с почтой, активация пользователя</li>
    <li>Ребусы перестраивать на основе сравнения исходного (с задачами) и конечного (с ответами) файла</li>
    <li>Русифицировать все выбрасываемые ошибки</li>
    <li>Возможность показать bubble сверху по умолчанию</li>
    <li>Возможность вставить содержимое подсказки. Заменить подсказки в плагине pascal.</li>
    <li>Избавиться от трёх методов: getTitle, getJsParams, getSmartyResParams и добавить js ресурсы к админским страницам, в частности к APFoldingEdit добавить unique и ident</li>
    <li>Управление постом - использовать hint</li>
    <li>Импорт настроек БД при разворачивании схемы</li>
	<li>ButtonsController - добавить возможность повесить updater</li>
    <li>Переписать кнопки управления на javascript</li>
    <li>Научиться в форме показывать карточку клиента с заменой формул на картинки</li>
    <li>todo - проверять, есть ли шаблонное сообщение</li>
    <li>Автоподключение FoldedResources</li>
    <li>Доделать механизм валидации вводимых пользователем данных, максимальная длина полей</li>
    <li>Валидация форм</li>
    <li>$PARAMS['folding']['fident'] = $manager->getEntityName();//TODO AP_APLibEdit</li>
    <li>FORM_RegEditForm.getDataImpl - выкинуть</li>
    <li>Добавить описание для подписчиков на PsGlobalInterval</li>
    <li>PsIntervals.makeSingle и использовать в PsMathFuncDefInterval.intervalBounds</li>
    <li>PsStrings.replaceOneByOnne(..., filter) - напистаь тесты</li>
</ol>